code-review/NRB_3471_3546/База_Было/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/УстановкиПоУмолчанию/Ext/Module.bsl
Процедура ЗаполнитьРеквизитыПриВводеНовогоДокумента(Объект) Экспорт
	Если Объект.ЭтоНовый() Тогда 
        Объект.Организация = ПараметрыСеанса.Организация;
		Объект.Автор = ПараметрыСеанса.Сотрудник;
		Объект.Дата = ТекущаяДата();
		Объект.УстановитьНовыйНомер();
	Иначе
		Объект.Изменил = ПараметрыСеанса.Сотрудник;
	КонецЕсли;	
КонецПроцедуры

Функция ПроверкаРеквизитов(Объект, СписокРеквизитов) Экспорт
	Результат = Ложь;
	Для Каждого Реквизит  Из СписокРеквизитов Цикл
		Если ОбщегоНазначения.ЗначениеНеЗаполнено(Объект[Реквизит.Значение]) Тогда
			Сообщить("Необходимо заполнить реквизит "+Реквизит.Значение, СтатусСообщения.Важное);
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ПолучитьПараметрыВалюты(Валюта, Дата) Экспорт
	РеглВалюта = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Константы.ВалютаРегламентированногоУчета.Получить()));
	РеглВалюта.Курс = ?(ОбщегоНазначения.ЗначениеНеЗаполнено(РеглВалюта.Курс), 1, РеглВалюта.Курс) ;
	Результат = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Валюта));
	Результат.Курс = ?(ОбщегоНазначения.ЗначениеНеЗаполнено(Результат.Курс), 1, Результат.Курс)/РеглВалюта.Курс;
	Результат.Кратность = ?(ОбщегоНазначения.ЗначениеНеЗаполнено(Результат.Кратность), 1, Результат.Кратность);
	Возврат Результат;
КонецФункции

Функция ПолучитьКурсПоНаименованиюВалюты(НаименованиеВалюты, Дата) Экспорт
	Валюта = Справочники.Валюты.НайтиПоНаименованию(СокрЛП(НаименованиеВалюты));
	Если Валюта.Пустая() Тогда
		Возврат 0;
	Иначе
		ПараметрВ = ПолучитьПараметрыВалюты(Валюта, Дата);
	КонецЕсли;
	Возврат ПараметрВ.Курс;
КонецФункции
